web-programming-exercise/management-project-coursework/ci4_pos/app/Controllers/Main.php

SELECT *
FROM `products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function products()
    {
        $this->data['page_title'] = "Products";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->prod_model->countAllResults();
        $this->data['products'] = $this->prod_model->paginate($this->data['perPage']);

SELECT *
FROM `products`
WHERE `id` = '20'
 LIMIT 1
---

        // Ambil data produk untuk ditampilkan
        $this->data['page_title'] = "Edit Product";
        $this->data['product'] = $this->prod_model->where("id", $id)->first();